## Plan Result (prod_video_hearings - TerraformPlanApply)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor[&#34;HMCTS&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.enterprise.module.bootstrap.azuread_group.storage_blob_data_contributor["HMCTS"] will be created
  + resource "azuread_group" "storage_blob_data_contributor" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Storage Blob Data Contributor (mg:HMCTS)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.storage_blob_data_contributor["HMCTS"] will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/HMCTS"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label prod_video_hearings - TerraformPlanApply/add-or-update: POST https://api.github.com/repos/hmcts/azure-enterprise/issues/116/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":116,"Program":"tfcmt","SHA1":"","Target":"prod_video_hearings - TerraformPlanApply","Vars":{}} -->